results/routeA/initialization_check/A-Ra1e3-medium/0/gh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
-8.802816901408451e-05
-8.802816901408451e-05
-8.802816901408451e-05
-8.802816901408451e-05
-8.802816901408448e-05
-8.802816901408451e-05
-8.802816901408451e-05
-8.80281690140845e-05
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-8.802816901408451e-05
-0.0002640845070422535
-0.0004401408450704224
-0.0006161971830985916
-0.0007922535211267607
-0.0009683098591549296
-0.001144366197183099
-0.001320422535211267
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-8.802816901408453e-05
-0.0002640845070422535
-0.0004401408450704224
-0.0006161971830985916
-0.0007922535211267607
-0.0009683098591549296
-0.001144366197183099
-0.001320422535211267
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
