results/routeA/initialization_check/A-Ra1e3-medium/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
-8.802816901408451e-05
-8.802816901408451e-05
-8.802816901408451e-05
-8.802816901408451e-05
-8.802816901408451e-05
-8.802816901408451e-05
-8.802816901408451e-05
-8.802816901408451e-05
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-8.798415492957747e-05
-0.0002639524647887324
-0.0004399207746478873
-0.0006158890845070422
-0.0007918573943661972
-0.0009678257042253521
-0.001143794014084507
-0.001319762323943662
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-8.807218309859155e-05
-0.0002642165492957747
-0.0004403609154929577
-0.0006165052816901409
-0.000792649647887324
-0.000968794014084507
-0.00114493838028169
-0.001321082746478873
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform -0.01408450704225352;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
