results/routeA/initialization_check/A-Ra1e3-medium/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    hotWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       12640;
    }
    coldWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       12720;
    }
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       12800;
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       12880;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          6400;
        startFace       12960;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          6400;
        startFace       19360;
    }
)

// ************************************************************************* //
